app/views/tasks/new.html.erb

  <%= form.text_field :number, placeholder: "number" %>
  <%= form.select(:project_ids, options_for_select(Project.pluck(:name, :id)), { prompt: "Select Project", include_hidden: false }, { required: true }) %>
---
SELECT "projects"."name", "projects"."id" FROM "projects"