app/views/home/index.html.erb

SELECT COUNT(*) FROM "projects"
SELECT COUNT(*) FROM "tasks"
---
<%= link_to "Add a New task", new_task_path, class: "btn btn-lg btn-success" %><hr>
<h2><%= link_to "Total Project Count -  #{Project.count}", projects_path %></h2>
<h2><%= link_to "Total Task Count -  #{Task.count}", tasks_path %></h2>