app/views/projects/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 3]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."project_id" = ?  [["project_id", 3]]
---
<%= link_to "Add a New task",  new_task_path, class:  "btn btn-success" %><hr>
<% if @project.tasks.present? %>
<h2> Total Tasks: <%= @project.tasks.count %> </h2>
<% @project.tasks.each do |task| %>