app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "nitesh project"], ["number", 2], ["created_at", "2022-03-22 21:20:38.130377"], ["updated_at", "2022-03-22 21:20:38.130377"]]
---
  def create
     @project = Project.create(project_params)

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "projects" SET "number" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["number", 21], ["updated_at", "2022-03-22 21:19:03.087907"], ["id", 1]]
---
  def update
    @project = Project.find(params[:id])
    @project.update(project_params)