app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "number", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Assigned new"], ["number", 6], ["project_id", 3], ["created_at", "2022-03-23 07:46:06.292945"], ["updated_at", "2022-03-23 07:46:06.292945"]]
---
  def create
  @task = Task.new(task_params)
  if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "name" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", "First Tasked"], ["updated_at", "2022-03-23 08:38:51.935209"], ["id", 1]]
---
  def update
    @task = Task.find(params[:id])
    @task.update(task_params)